warm_up/app/models/user.rb

    def reset_session_token
        self.session_token = generate_unique_session_token
        self.save
---
UPDATE "users" SET "updated_at" = ?, "session_token" = ? WHERE "users"."id" = ?  [["updated_at", "2023-03-14 20:46:00.606820"], ["session_token", "[FILTERED]"], ["id", 5]]

    def generate_unique_session_token

        token = SecureRandom::urlsafe_base64
        # debugger
        while User.exists?(session_token: token)
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = ? LIMIT ?  [["session_token", "[FILTERED]"], ["LIMIT", 1]]