warm_up/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "email", "password_digest", "session_token") VALUES (?, ?, ?, ?, ?)  [["created_at", "2023-03-14 20:39:52.824073"], ["updated_at", "2023-03-14 20:39:52.824073"], ["email", "xCZcs"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"]]